Revit 2026 API

# PulldownButtonAddPushButton Method

---

Adds a new pushbutton to the pulldown button and associates it with an ExternalCommand.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PushButton AddPushButton(
	PushButtonData buttonData
)
```
```vb
Public Function AddPushButton (
	buttonData As PushButtonData
) As PushButton
```
```cpp
public:
PushButton^ AddPushButton(
	PushButtonData^ buttonData
)
```
```fsharp
member AddPushButton :
        buttonData : PushButtonData -> PushButton
```

#### Parameters

buttonData PushButtonData
    An object containing the data needed to construct the pushbutton.

#### Return Value

PushButton The newly added pushbutton.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when buttonData is . |
| ArgumentException | Thrown when button with buttonData.Name already exists in the button. |

The new button will display its large image if PushButton.LargeImage is set.

#### Reference

PulldownButton Class

Autodesk.Revit.UI Namespace